Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Let's take the following scenario as an example: `quarkus-extension-a` has an optional dependency on `quarkus-extension-b` which should be included in a Quarkus application only if `quarkus-extension-c` is found among its dependencies (direct or transitive). In other words, the presence of `quarkus-extension-c` is the condition which, if satisfied, enables `quarkus-extension-b` during the build of a Quarkus application.
ja_jp: 次のシナリオを考えてみましょう: `quarkus-extension-a` に、その（直接または推移的）依存関係の中に `quarkus-extension-c` が見つかった場合にのみ有効にする必要がある `quarkus-extension-b` へのオプションの依存関係があるとします。言い換えれば、 `quarkus-extension-c` の存在が満たされた場合に、Quarkusアプリケーションのビルド中に `quarkus-extension-b` を有効にする条件です。

source: Let's take the instrumentable object (`io.agroal.api.AgroalDataSourceMetrics`) case first. In this case, you can do the following:
ja_jp: まず、インストルメント可能オブジェクト (`io.agroal.api.AgroalDataSourceMetrics`) の場合を見てみましょう。この場合、次のことができます。

source: Let's try something we couldn't do before. We'll move the non-application endpoint outside of the HTTP root path by specifying an absolute path, `/q`:
ja_jp: 今までできなかったことをやってみましょう。絶対パス `/q` を指定して、アプリケーション以外のエンドポイントをHTTPルートパスの外側に移動させます。

source: Let's try this application by running it:
ja_jp: このアプリケーションを実行して試してみましょう:

source: Let's try this. In a terminal, run:
ja_jp: 試してみましょう。 ターミナルで次を実行します。

source: Let's try to call `http://localhost:8080/weather?city=Raleigh` again. You're still waiting a long time before receiving an answer. This is normal since the server just restarted and the cache was empty.
ja_jp: `http://localhost:8080/weather?city=Raleigh` をもう一度呼び出して確認してみてください。返事が来るまでにまだ長い時間待たされています。これはサーバーが再起動したばかりでキャッシュが空になっているので正常です。

source: Let's update `pom.xml` as follows:
ja_jp: `pom.xml` を次のように更新しましょう。

source: Let's use Docker to start one of each:
ja_jp: Dockerを使ってそれぞれ1つずつ起動してみましょう。

source: Let's use `ContainerRequestFilter` to add logging capability to our service. We can do that by implementing `ContainerRequestFilter` and annotating it with the `@Provider` annotation:
ja_jp: `ContainerRequestFilter` を使用して、サービスにロギング機能を追加してみましょう。 `ContainerRequestFilter` を実装して、 `@Provider` アノテーションをつけることで実現できます。

source: Let's use `curl` (or a browser) to visit our endpoint a few times:
ja_jp: `curl` (またはブラウザー) を使用して、エンドポイントに数回アクセスしてみましょう:

source: Let's use this to support removal of fruits in the database:
ja_jp: これを使用して、データベース内の fruits の削除をサポートしましょう。

source: Let's write a REST endpoint that reads the next 3 items from a xref:kafka.adoc[Kafka topic], stores them in a database using xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] (all in the same transaction) before returning them to the client, you can do it like this:
ja_jp: link:kafka.html[Kafkaトピック]から次の3つのアイテムを読み込み、 link:hibernate-orm-panache.html[Panacheを使ったHibernate ORM]でデータベースに格納してから（すべて同じトランザクションで）、クライアントに返すRESTエンドポイントを書くとしたら、次のようになります:

source: Let's write a simple JAX-RS resource which has all the tokens returned in the authorization code grant response injected:
ja_jp: 認可コードグラントのレスポンスで返されたすべてのトークンが注入されたシンプルなJAX-RSリソースを書いてみましょう。

source: Let's write a simple Jakarta REST resource that has all the tokens returned in the authorization code grant response injected:
ja_jp: 認可コードグラントレスポンスで返されるすべてのトークンを注入した、単純な Jakarta REST リソースを書いてみましょう：

source: Let's write a simple Jakarta REST resource which has all the tokens returned in the authorization code grant response injected:
ja_jp: 認可コードグラントレスポンスで返されたトークンをすべて注入した、シンプルなJakarta RESTリソースを書いてみましょう:

source: Let's write a simple test that shows this off to load some static resources. First create a simple HTML file in `src/main/resources/META-INF/resources/index.html` :
ja_jp: 静的なリソースをロードするための簡単なテストを書いてみましょう。まず、シンプルなHTMLファイルを `src/main/resources/META-INF/resources/index.html` に作成します:

source: Let’s consider the following client endpoint:
ja_jp: 次のクライアントエンドポイントを考えてみましょう。

source: Let’s discuss a few examples explaining how this new strategy improves the user experience without limiting efficiency and flexibility.
ja_jp: この新しい戦略が、効率性や柔軟性を損なうことなく、ユーザーエクスペリエンスを向上させることができるか、いくつかの例を挙げて説明します。

source: Let’s discuss first how to debug the second process, which is the one you most likely to want to debug. The starting point for the second process is the `com.oracle.svm.hosted.NativeImageGeneratorRunner` class. To debug this process, simply add `--debug-attach=*:8000` as an additional build time argument:
ja_jp: まず、最もデバッグしたいと思われる2番目のプロセスのデバッグ方法について説明します。2番目のプロセスのスタートポイントは、 `com.oracle.svm.hosted.NativeImageGeneratorRunner` クラスです。このプロセスをデバッグするには、ビルド時の引数として `--debug-attach=*:8000` を追加するだけです。

source: Let’s imagine you have a Pulsar broker running, and accessible using the `pulsar:6650` address. Configure your application to receive Pulsar messages on the `prices` channel as follows:
ja_jp: Pulsar ブローカーが実行中で、 `pulsar:6650` アドレスを使用してアクセスできるとします。 次のようにして、 `prices` チャネルで Pulsar メッセージを受信するようにアプリケーションを設定します。

source: Let’s imagine you have a Pulsar broker running, and accessible using the `pulsar:6650` address. Configure your application to write the messages from the `prices` channel into a Pulsar Messages as follows:
ja_jp: Pulsar ブローカーが実行中で、 `pulsar:6650` アドレスを使用してアクセスできるとします。 次のように、 `prices` チャネルからのメッセージを Pulsar メッセージに書き込むようにアプリケーションを設定します。

source: Let’s learn a little more about how Quarkus turned the creation of a tax application into an exciting and rewarding project for it’s developers.
ja_jp: Quarkusがどのようにして税務アプリケーションの作成を、開発者にとってエキサイティングでやりがいのあるプロジェクトに変えたのか、もう少し詳しく見てみましょう。

source: Let’s pick a helpful example that highlights the benefits of using Camel Quarkus in contrast with other development approaches. Implementing and evolving API services sounds like a use case almost every reader can relate to. We’ll use the broadly adopted OpenApi specification.
ja_jp: 他の開発アプローチと対比して、Camel Quarkusを使用する利点を強調する役に立つ例を選んでみましょう。APIサービスの実装と進化は、ほとんどすべての読者が共感できるユースケースのように聞こえます。ここでは、広く採用されているOpenApiの仕様を使用します。

source: Let’s see how to build and deploy a Quarkus app using https://docs.ansible.com/ansible/latest/index.html[Ansible]. We’ll see how we can automate the entire process, from the code checkout to the application compilation using Maven and then its deployment and start of the service, as a https://systemd.io/[systemd service], on the target system using Ansible and its collection for Quarkus.
ja_jp: link:https://docs.ansible.com/ansible/latest/index.html[Ansible] を使ってQuarkusアプリをビルドしてデプロイする方法を見てみましょう。コードのチェックアウトから、Mavenを使用してアプリケーションをコンパイルし、AnsibleとQuarkus用のコレクションを使用して、ターゲットシステム上に link:https://systemd.io/[systemd] サービスとしてデプロイしてサービスを開始するまでのプロセス全体を自動化する方法を見ていきます。

source: Let’s see this in action.
ja_jp: 実際に見てみましょう。

source: Let’s start with the basics: HTTP microservices. In this context, you need to develop an HTTP endpoint, often called REST or CRUD. You process incoming HTTP requests, and to do so you often need to rely on other services, such as databases, or another HTTP service.
ja_jp: まず、基本的なことから始めましょう。HTTPマイクロサービスです。ここでは、RESTやCRUDと呼ばれるHTTPエンドポイントを開発する必要があります。受信したHTTPリクエストを処理しますが、そのためにはデータベースなどの他のサービスや別のHTTPサービスに依存する必要があります。

source: Let’s start with the basics: HTTP microservices. You need to develop an HTTP endpoint, often called REST. You process incoming HTTP requests, and to do so, you usually need to rely on other services, such as databases or other HTTP services. Let’s take a very simple application handling _elements_ from the https://en.wikipedia.org/wiki/Periodic_table[periodic table].
ja_jp: まずは基本から始めましょう。HTTP マイクロサービスです。HTTP エンドポイント (REST と呼ばれることが多い) を開発する必要があります。 受信した HTTP リクエストを処理するには、通常、データベースや他の HTTP サービスなどの他のサービスに依存する必要があります。 https://en.wikipedia.org/wiki/Periodic_table[周期表] の _要素_ を処理する非常に単純なアプリケーションを見てみましょう。

source: Let’s sum it up: There is a processor class which initializes the extension, a configuration class which is needed to make the extension configurable, a value factory class which takes these configurations and creates a AWS CloudWatch connection as well as a custom _LogHandler_ class which pushes each log message to CloudWatch.
ja_jp: 要約しましょう。エクステンションを初期化するProcessorクラス、エクステンションを設定可能にするために必要なConfigurationクラス、これらの設定を受けてAWS CloudWatch接続を作成するValue Factoryクラス、そして各ログメッセージをCloudWatchにプッシュするカスタム _LogHandler_クラスがあります。

source: Let’s take a very simple application handling <em>elements</em> from the periodic table. The code would be something like:
ja_jp: 周期表の<em>元素</em>を扱う非常にシンプルなアプリケーションを考えてみましょう。コードは次のようなものになります。

source: Level
ja_jp: レベル

source: Levels of capability
ja_jp: 機能レベル

source: Leyden AOT requires **JDK 24 or newer**. For older JDK versions, Quarkus can fall back to AppCDS (see <<appcds-legacy>>).
ja_jp: Leyden AOT には **JDK 24 以降** が必要です。それより古い JDK バージョンの場合、Quarkus は AppCDS にフォールバックできます (<<appcds-legacy>> を参照)。

source: License
ja_jp: ライセンス

source: Lifecycle
ja_jp: ライフサイクル

source: Lifecycle Callbacks
ja_jp: ライフサイクルコールバック

source: Lifecycle Callbacks Example
ja_jp: ライフサイクルコールバックの例

source: Lifecycle of Resources
ja_jp: リソースのライフサイクル

source: Lifespan
ja_jp: 存続期間

source: Lifespan added to the `issued at` (`iat`) claim value to calculate the expiry (`exp`) claim value
ja_jp: 有効期限 (`exp`) クレーム値を計算するために、`issued at` (`iat`) クレーム値に追加される有効期間

source: Lifespan grace
ja_jp: 有効期間の猶予

source: Light device domain model:
ja_jp: 軽量のデバイスドメインモデル:

source: Lightweight
ja_jp: 軽量

source: Lightweight, JVM-managed threads. They extend the link:{thread}[Thread] class but are not tied to one specific OS thread. Thus, scheduling virtual threads is the responsibility of the JVM.
ja_jp: 軽量で、JVM が管理するスレッド。link:{thread}[スレッド] クラスを拡張していますが、1 つの特定の OS スレッドに関連付けられていません。 したがって、仮想スレッドのスケジューリングは JVM の責任となります。

source: Like `Author`, we mark a constructor as a `@ProjectionConstructor`, so that a `Book` instance can be reconstructed from the content of the index.
ja_jp: `Author`と同様に、コンストラクターを `@ProjectionConstructor`としてマークします。 これにより、インデックスの内容から `Book` インスタンスを再構築できるようにします。

source: Like a capability name, a capability prefix is a dot-separated string that is composed of either the first capability name element or a dot-separated sequence of the capability name elements starting from the first one. E.g. for capability `io.quarkus.resteasy.json.jackson` the following prefixes will be registered:
ja_jp: ケイパビリティ名と同様に、ケイパビリティのプレフィックスは、最初のケイパビリティ名要素、または最初のケイパビリティ名要素から始まるドット区切りのシーケンスのいずれかで構成されるドット区切りの文字列です。例）ケイパビリティ `io.quarkus.resteasy.json.jackson` には以下のプレフィックスが登録されます:

source: Like all instrumentation methods, collecting metrics comes with a small overhead that can impact the application performances.
ja_jp: 全ての計測手法のように、メトリクスの収集にはわずかなオーバーヘッドが伴い、アプリケーションのパフォーマンスに影響を与える可能性があります。

source: Like any other Quarkus applications, you can package it with: `mvn package`. You can also package the application into a native executable with: `mvn package -Dnative`.
ja_jp: 他のQuarkusアプリケーションと同様に、次のコマンドでパッケージ化することができます: `mvn package` また、アプリケーションをネイティブ実行可能ファイルにパッケージすることもできます: `mvn package -Dnative`

source: Like any other Quarkus applications, you can package it with: `mvn package`. You can also package the application into a native executable with: `mvn package -Pnative`.
ja_jp: 他のQuarkusアプリケーションと同様に、 `mvn package` でパッケージングすることができます。また、 `mvn package -Pnative` でアプリケーションをネイティブ実行可能ファイルにパッケージングすることもできます。

source: Like most Maven plugins, the Quarkus Maven Plugin has a `help` goal that prints the description of the plugin, listing all available goals as well as their description. It is also possible to print out detailed information about a goal, all its parameters and their default values. For instance, to see the help for the `create` goal, run:
ja_jp: ほとんどの Maven プラグインと同様に、Quarkus Maven Plugin にも `help` ゴールがあり、プラグインの説明が出力され、利用可能なすべてのゴールとその説明が一覧表示されます。また、ゴールに関する詳細情報、すべてのパラメーターとそのデフォルト値を出力することも可能です。たとえば、 `create` ゴールのヘルプを見るには、次のように実行します:

source: Like most Quarkus extensions, the Quarkus AWS Lambda HTTP/REST extensions support Live Coding.
ja_jp: Quarkus AWS Lambda HTTP/REST エクステンションは、大概の Quarkus エクステンションと同様、ライブコーディングをサポートしています。

source: Like the https://quarkus.io[website^] says, it really is pure *developer joy*.
ja_jp: https://quarkus.io[ウェブサイト^] にあるように、本当に純粋な *開発者の満足*です。

source: Likewise, don't fall into the trap of only measuring private memory which is what the process uses that is not shareable with other processes. While private memory might be useful in a environment deploying many different applications (and thus sharing memory a lot), it is very misleading in environments like Kubernetes/OpenShift.
ja_jp: 同様に、プロセスが使用している、他のプロセスと共有されないプライベートメモリーだけを測定するという罠にはまらないようにしましょう。プライベートメモリーは、多くの異なるアプリケーションをデプロイする環境(したがってメモリーを多く共有する)では有用かもしれませんが、Kubernetes/OpenShiftのような環境では非常に誤解を招く可能性があります。

source: Likewise, don't fall into the trap of only measuring private memory which is what the process uses that is not shareable with other processes. While private memory might be useful in an environment deploying many different applications (and thus sharing memory a lot), it is very misleading in environments like Kubernetes/OpenShift.
ja_jp: 同様に、プロセスが使用している、他のプロセスと共有されないプライベートメモリだけを測定するという罠には陥らないようにしましょう。プライベートメモリは、多くの異なるアプリケーションをデプロイする環境(メモリを多く共有する)では有用かもしれませんが、Kubernetes/OpenShiftのような環境では非常に誤解を招く可能性があります。

source: Likewise, the Java type of the object resolved from `foo.message` must have a property `toLowerCase` or a matching template extension method must exist.
ja_jp: 同様に、 `foo.message` から解決されたオブジェクトの Java 型は、プロパティー `toLowerCase` を持つか、一致するテンプレート拡張メソッドが存在しなければなりません。

source: Likewise, there is a similar way to inject a configured instance of `ManagedExecutor` using the https://javadoc.io/doc/io.smallrye/smallrye-context-propagation-api/latest/io/smallrye/context/api/ManagedExecutorConfig.html[`@ManagedExecutorConfig`] annotation:
ja_jp: 同様に、 https://javadoc.io/doc/io.smallrye/smallrye-context-propagation-api/latest/io/smallrye/context/api/ManagedExecutorConfig.html[`@ManagedExecutorConfig`] アノテーションを使用して設定された `ManagedExecutor` のインスタンスをインジェクトする類似の方法があります:

source: Limit concurrency of that HTTP endpoint using SmallRye Fault Tolerance,
ja_jp: Smallrye Fault Tolerance を使用して、その HTTP エンドポイントの同時実行を制限します。

source: Limit concurrency of that HTTP endpoint using Smallrye Fault Tolerance,
ja_jp: Smallrye Fault Tolerance を使用して、その HTTP エンドポイントの同時実行を制限します。

source: Limit of client memory usage (in byte). The 64M default can guarantee a high producer throughput.
ja_jp: クライアントのメモリ使用量の上限 (バイト単位)。デフォルトの 64M は高いプロデューサのスループットを保証します。

source: Limit the concurrency of the HTTP endpoint to "1", preventing starting multiple transactions at a given time.
ja_jp: HTTP エンドポイントの同時実行を "1" に制限し、特定の時間に複数のトランザクションを開始しないようにします。

source: Limitation
ja_jp: 制限

source: Limitations
ja_jp: 制約事項

source: Limitations and other things you should know
ja_jp: 制限事項など知っておくべきこと

source: Limitations of Caching
ja_jp: キャッシュの制限

source: Limitations of HTTP Basic authentication
ja_jp: HTTP Basic認証の制限事項

source: Limitations with using Basic authentication
ja_jp: Basic認証を使用した場合の制限事項

source: Limiting extension catalog to an offering
ja_jp: エクステンションカタログのオファリングへの制限

source: Limiting the work needed by an application team to deploy a component, and hyper-standardize Kubernetes deployment objects.
ja_jp: アプリケーションチームがコンポーネントをデプロイするために必要な作業を限定し、Kubernetesのデプロイメントオブジェクトを超標準化する。

source: Link back to the key used when you added the build time data in `addBuildTimeData` on the Page BuildItem.
ja_jp: Page BuildItem の `addBuildTimeData` でビルド時データを追加したときに使用したキーにリンクします。

source: Link to an externally hosted image. This is used in the Quarkus dev tools as the extension icon. It should be square, and any resolution greater than 220 pixels. Supported formats are png, jpeg, tiff, webp, and svg. Alternatively, if you https://docs.github.com/en/repositories/managing-your-repositorys-settings-and-features/customizing-your-repository/customizing-your-repositorys-social-media-preview[set the social media preview] on the extension's source code repository, the tools will pick up that image.
ja_jp: 外部でホストされている画像へのリンクです。これは、Quarkusの開発ツールでエクステンションのアイコンとして使用されます。正方形で、220ピクセル以上の解像度である必要があります。サポートされている形式は、png、jpeg、tiff、webp、およびsvgです。あるいは、エクステンションのソースコードリポジトリで https://docs.github.com/en/repositories/managing-your-repositorys-settings-and-features/customizing-your-repository/customizing-your-repositorys-social-media-preview[ソーシャルメディアプレビューを設定] すると、ツールはその画像をピックアップします。

source: Link to the Qute template in `/deployment/src/main/resources/dev-ui/`.
ja_jp: `/deployment/src/main/resources/dev-ui/` の Qute テンプレートにリンクします。

source: Link to the Web Component in `/deployment/src/main/resources/dev-ui/`. The title can also be defined (using `.title("My title")` in the builder), but if not, the title will be assumed from the componentLink, which should always have the format `qwc` (stands for Quarkus Web Component) dash `extensionName` (example, `arc` in this case ) dash `page title` ("Beans" in this case)
ja_jp: `/deployment/src/main/resources/dev-ui/` の Web コンポーネントへのリンク。タイトルも (ビルダーで `.title("My title")` を使用して定義できますが、定義しない場合は componentLink からタイトルが取得されます。componentLink の形式は必ず `qwc` (Quarkus Web Component の略) ダッシュ `extensionName` (この例では `arc`) ダッシュ `page title` (ここでは "Beans") です。

source: Link to the extension guide or documentation page
ja_jp: エクステンションガイドまたはドキュメントページへのリンク

source: Linked Editing Range Support in Qute Templates
ja_jp: Quteテンプレートにおけるリンクされた編集範囲のサポート

source: Linking to your full-page templates
ja_jp: フルページテンプレートへのリンク

source: Links
ja_jp: リンク

source: Links these three modules where necessary:
ja_jp: 必要に応じて、これらの3つのモジュールをリンクします。

source: Links to the online Quarkus guide for the extension (if available).
ja_jp: エクステンションのオンライン Quarkus ガイドへのリンク (利用可能な場合)。

source: Lint documentation changes with Vale
ja_jp: Valeによるドキュメント変更の性的解析

source: Linux/Power PC 64 bits
ja_jp: Linux/Power PC 64 ビット

source: Linux/S390 64 bits
ja_jp: Linux/S390 64 ビット

source: Linux/x86 32bits
ja_jp: Linux/x86 32 ビット

source: Linux/x86 64bits
ja_jp: Linux/x86 64 ビット

source: Liquibase MongoDB can be configured to support multiple clients. The properties are prefixed exactly the same way as named MongoDB clients. For example:
ja_jp: Liquibase MongoDB は、複数のクライアントをサポートするように設定できます。プロパティーには、名前付き MongoDB クライアントと全く同じ方法でプレフィックスが付与されます。例:

source: Liquibase MongoDB extension support relies on the Quarkus MongoDB client config. For the time being, it does not support multiple clients. First, you need to add the MongoDB config to the `{config-file}` file in order to allow Liquibase to manage the schema.
ja_jp: LiquibaseのMongoDBエクステンションサポートは、QuarkusのMongoDBクライアント設定に依存しています。今のところ、複数のクライアントには対応していません。まず、Liquibase がスキーマを管理できるようにするために、MongoDB config を `{config-file}` ファイルに追加する必要があります。

source: Liquibase MongoDB is configured using a connection string, we do our best to craft a connection string that matches the MongoDB client configuration but if some configuration properties are not working you may consider adding them directly into the `quarkus.mongodb.connection-string` config property.
ja_jp: Liquibase MongoDB は接続文字列を使用して設定されます。MongoDB クライアントの設定にマッチする接続文字列を作成するよう最善を尽くしますが、いくつかの設定プロパティが動作しない場合は、 `quarkus.mongodb.connection-string` の設定プロパティに直接追加してください。

source: Liquibase MongoDB on Kubernetes
ja_jp: Kubernetes 上の Liquibase MongoDB

source: Liquibase Mongodb on Kubernetes
ja_jp: Kubernetes上でのLiquibase Mongodb

source: Liquibase can be configured for multiple datasources. The Liquibase properties are prefixed exactly the same way as the named datasources, for example:
ja_jp: Liquibase は複数のデータソースに対して設定することができます。Liquibase のプロパティーは、例えば、名前のついたデータソースと全く同じように接頭辞が付けられます。

source: Liquibase is an open source tool for database schema change management, it allows managing MongoDB databases via it&#8217;s MongoDB Extension.
ja_jp: Liquibase はデータベースのスキーマ変更管理のためのオープンソースツールで、そのMongoDB Extension を介して MongoDB データベースを管理することができます。

source: Liquibase needs a database either in the connection string or with the `quarkus.mongodb.database` property.
ja_jp: Liquibase は、接続文字列か `quarkus.mongodb.database` プロパティでデータベースを必要とします。

source: Liquibase on Kubernetes
ja_jp: Kubernetes上でのLiquibase

source: Liquibase support relies on the Quarkus datasource config. It can be customized for the default datasource as well as for every <<multiple-datasources,named datasource>>. First, you need to add the datasource config to the `{config-file}` file in order to allow Liquibase to manage the schema.
ja_jp: Liquibaseのサポートは、Quarkusのデータソース設定に依存しています。この設定は、デフォルトのデータソースだけでなく、すべての link:#multiple-datasources[名前付きデータソース] 用にカスタマイズすることができます。まず、Liquibaseがスキーマを管理できるようにするために、 `{config-file}` ファイルにデータソース設定を追加する必要があります。

source: Liquibase support relies on the Quarkus datasource config. It can be customized for the default datasource as well as for every xref:multiple-datasources[named datasource]. First, you need to add the datasource config to the `{config-file}` file in order to allow Liquibase to manage the schema.
ja_jp: Liquibase のサポートは、Quarkus のデータソース設定に依存しています。これは、デフォルトのデータソースだけでなく、すべての xref:multiple-datasources[名前付きデータソース] に対してカスタマイズすることができます。まず、データソース設定を `{config-file}` ファイルに追加し、Liquibase がスキーマを管理できるようにする必要があります。

source: List all available gRPC services:
ja_jp: 利用可能なgRPCサービスをすべてリスト：

source: List all jobs in the scheduler.
ja_jp: スケジューラーを再開します。

source: List all the CDI beans for which you want to enable an alternative mocked bean.
ja_jp: 代替モックビーンを有効にしたい CDI ビーンをすべて列挙します。

source: List all the configuration properties per extensions
ja_jp: エクステンションごとのすべての設定プロパティのリスト

source: List all the keys
ja_jp: すべてのキーをリストアップします

source: List of Quarkus core extensions automatically instrumented with Micrometer
ja_jp: Micrometer で自動的に計装される Quarkus コアエクステンションのリスト

source: List of applied or not applied liquibase ChangeSets
ja_jp: 適用された、または適用されていないliquibaseのChangeSetsのリスト

source: List of audiences
ja_jp: オーディエンスのリスト

source: List of authentication mechanism use cases
ja_jp: 認証メカニズムのユースケースリスト

source: List of authentication mechanism use-cases
ja_jp: 認証メカニズムのユースケース一覧

source: List of decryption algorithms. Set it to `RSA-OAEP-256` to support RSA-OAEP with SHA-256 only.
ja_jp: 復号化アルゴリズムのリスト。SHA-256 のみの RSA-OAEP をサポートするには、 `RSA-OAEP-256` に設定します。

source: List of exporters to be used for logs, separated by commas. Has one of the values from _ExporterType_: `otlp`, `cdi`, `none`. This is a *build* time property and setting it to `none` will disable logs data output.
ja_jp: カンマ区切りでログに使用するエキスポーターのリスト。 _ExporterType_ のいずれかの値を持ちます： `otlp` , `cdi` , `none` . これは *ビルド* 時のプロパティで、 `none` に設定するとログデータの出力が無効になります。

source: List of exporters to be used for metrics, separated by commas. Has one of the values from _ExporterType_: `otlp`, `cdi`, `none`. This is a *build* time property and setting it to `none` will disable metrics data output.
ja_jp: メトリクスに使用するエクスポーターの、コンマ区切りリスト。_ExporterType_ に `otlp`、 `cdi`、 `none` のいずれかの値が指定されています。これは *ビルド* 時のプロパティーであり、 `none` に設定するとメトリクスデータの出力が無効になります。

source: List of exporters to be used for tracing, separated by commas. Has one of the values from _ExporterType_: `otlp`, `cdi`, `none`. This is a *build* time property and setting it to `none` will disable tracing data output.
ja_jp: トレースに使用するエクスポーターの、コンマ区切りリスト。_ExporterType_ に `otlp`、 `cdi`、 `none` のいずれかの値が指定されています。これは *ビルド* 時のプロパティーであり、 `none` に設定するとトレースデータの出力が無効になります。

source: List of https://quarkus.io/guides/capabilities[capabilities] this extension provides
ja_jp: このエクステンションが提供する https://quarkus.io/guides/capabilities[機能] のリスト。

source: List of https://quarkus.io/guides/capabilities[capabilities] this extension requires to be provided by other Quarkus extensions
ja_jp: 他の Quarkus エクステンションからこのエクステンションに提供する必要がある https://quarkus.io/guides/capabilities[機能] のリスト。

source: List of https://quarkus.io/guides/conditional-extension-dependencies[conditional dependencies] this extension declares
ja_jp: このエクステンションが宣言する https://quarkus.io/guides/conditional-extension-dependencies[条件付き依存関係] のリスト。
